Repository: jokiefer/django-mptt2
Catalog: mptt2/locale/*/LC_MESSAGES/django.po
Languages: de

source: Delete
de: Löschen

source: The right side value rgt is allways greater than the node left side value lft.
de: Der rechte Knotenwert ist stets größer als der linke Knotenwert

source: Last Child
de: Letztes Kind

source: First Child
de: Erstes Kind

source: Left
de: Links

source: Right
de: Rechts

source: Cannot insert a node which has already been saved.
de: Ein bereits gespeicherter Knoten kann nicht hinzugefügt werden.

source: given position is not supported
de: Die angegepenen Position wird nicht unterstüzt

source: You can't insert a second root node.
de: Ein zweiter Wurzelknoten kann nicht hinzugefügt werden.

source: moving nodes between trees is not supported
de: Knoten Baumübergreifend zu verschieben wird nicht unterstützt.

source: An invalid position was given: %s.
de: Eine nicht zulässige Position wurde übergeben: %s.

source: A node may not be made a {move_kind} of {relatedness}
de: Ein Knoten sollte keine {move_kind} of {relatedness}

source: child
de: Kind

source: sibling
de: Geschwister

source: itself
de: selbst

source: its descendants.
de: seine Nachfahren

source: parent
de: Elternteil

source: The parent of this node
de: Das Elternteil des Knotens

source: tree
de: Baum

source: The unique tree, where this node is part of
de: Der eindeutige Baum dieses Knotens

source: left
de: links

source: The left value of the node
de: Der linke Wert des Knotens

source: right
de: rechts

source: The right value of the node
de: Der rechte Wert des Knotens

source: depth
de: Tiefe

source: The hierarchy level of this node inside the tree
de: Die hierarchische Tiefe des Knotens im Baum

source: insert node
de: Knoten einfügen

source: delete
de: löschen
